#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # juju_integration.admin_ui_public_ingress will be created
  + resource "juju_integration" "admin_ui_public_ingress" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "ingress"
          + name     = "admin-ui"
        }
      + application {
          + endpoint  = (known after apply)
          + name      = (known after apply)
          + offer_url = (known after apply)
        }
    }

  # juju_integration.hydra_admin_ui_info will be created
  + resource "juju_integration" "hydra_admin_ui_info" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "hydra"
        }
    }

  # juju_integration.hydra_admin_ui_oauth will be created
  + resource "juju_integration" "hydra_admin_ui_oauth" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "oauth"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = "oauth"
          + name     = "hydra"
        }
    }

  # juju_integration.kratos_admin_ui_info will be created
  + resource "juju_integration" "kratos_admin_ui_info" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "kratos-info"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = "kratos-info"
          + name     = "kratos"
        }
    }

  # juju_integration.oauth_ca_admin_ui will be created
  + resource "juju_integration" "oauth_ca_admin_ui" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "receive-ca-cert"
          + name     = "admin-ui"
        }
      + application {
          + endpoint  = (known after apply)
          + name      = (known after apply)
          + offer_url = (known after apply)
        }
    }

  # juju_integration.openfga_admin_ui will be created
  + resource "juju_integration" "openfga_admin_ui" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "openfga"
          + name     = "admin-ui"
        }
      + application {
          + endpoint  = (known after apply)
          + name      = (known after apply)
          + offer_url = (known after apply)
        }
    }

  # juju_integration.openfga_db will be created
  + resource "juju_integration" "openfga_db" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "database"
          + name     = "openfga-k8s"
        }
      + application {
          + endpoint = "database"
          + name     = "postgresql-k8s"
        }
    }

  # juju_integration.traefik_certs will be created
  + resource "juju_integration" "traefik_certs" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "certificates"
          + name     = "self-signed-certificates"
        }
      + application {
          + endpoint = "certificates"
          + name     = "traefik-public"
        }
    }

  # juju_model.core will be created
  + resource "juju_model" "core" {
      + credential = (known after apply)
      + id         = (known after apply)
      + name       = "core"
      + type       = (known after apply)
      + uuid       = (known after apply)
    }

  # juju_model.iam will be created
  + resource "juju_model" "iam" {
      + credential = (known after apply)
      + id         = (known after apply)
      + name       = "iam"
      + type       = (known after apply)
      + uuid       = (known after apply)
    }

  # juju_offer.ingress will be created
  + resource "juju_offer" "ingress" {
      + application_name = "traefik-public"
      + endpoints        = [
          + "ingress",
        ]
      + id               = (known after apply)
      + model_uuid       = (known after apply)
      + name             = "ingress"
      + url              = (known after apply)
    }

  # juju_offer.openfga will be created
  + resource "juju_offer" "openfga" {
      + application_name = "openfga-k8s"
      + endpoints        = [
          + "openfga",
        ]
      + id               = (known after apply)
      + model_uuid       = (known after apply)
      + name             = "openfga"
      + url              = (known after apply)
    }

  # juju_offer.postgresql will be created
  + resource "juju_offer" "postgresql" {
      + application_name = "postgresql-k8s"
      + endpoints        = [
          + "database",
        ]
      + id               = (known after apply)
      + model_uuid       = (known after apply)
      + name             = "postgresql"
      + url              = (known after apply)
    }

  # juju_offer.send_ca_certificate will be created
  + resource "juju_offer" "send_ca_certificate" {
      + application_name = "self-signed-certificates"
      + endpoints        = [
          + "send-ca-cert",
        ]
      + id               = (known after apply)
      + model_uuid       = (known after apply)
      + name             = "send-ca-cert"
      + url              = (known after apply)
    }

  # juju_offer.traefik_route will be created
  + resource "juju_offer" "traefik_route" {
      + application_name = "traefik-public"
      + endpoints        = [
          + "traefik-route",
        ]
      + id               = (known after apply)
      + model_uuid       = (known after apply)
      + name             = "traefik-route"
      + url              = (known after apply)
    }

  # module.admin_ui.juju_application.application will be created
  + resource "juju_application" "application" {
      + config      = {}
      + constraints = "arch=amd64"
      + id          = (known after apply)
      + machines    = (known after apply)
      + model_type  = (known after apply)
      + model_uuid  = (known after apply)
      + name        = "admin-ui"
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "identity-platform-admin-ui"
          + revision = (known after apply)
        }
    }

  # module.certificates.juju_application.self-signed-certificates will be created
  + resource "juju_application" "self-signed-certificates" {
      + config      = {}
      + constraints = "arch=amd64"
      + id          = (known after apply)
      + machines    = (known after apply)
      + model_type  = (known after apply)
      + model_uuid  = (known after apply)
      + name        = "self-signed-certificates"
      + storage     = (known after apply)
      + trust       = false
      + units       = 1

      + charm {
          + base     = "ubuntu@24.04"
          + channel  = "1/stable"
          + name     = "self-signed-certificates"
          + revision = (known after apply)
        }
    }

  # module.certificates.juju_offer.certificates will be created
  + resource "juju_offer" "certificates" {
      + application_name = "self-signed-certificates"
      + endpoints        = [
          + "certificates",
        ]
      + id               = (known after apply)
      + model_uuid       = (known after apply)
      + name             = "certificates"
      + url              = (known after apply)
    }

  # module.certificates.juju_offer.send_ca_cert will be created
  + resource "juju_offer" "send_ca_cert" {
      + application_name = "self-signed-certificates"
      + endpoints        = [
          + "send-ca-cert",
        ]
      + id               = (known after apply)
      + model_uuid       = (known after apply)
      + name             = "send-ca-cert"
      + url              = (known after apply)
    }

  # module.iam.data.juju_model.this will be read during apply
  # (config refers to values not yet known)
 <= data "juju_model" "this" {
      + id   = (known after apply)
      + uuid = (known after apply)
    }

  # module.iam.data.juju_offer.ca_certificate will be read during apply
  # (config refers to values not yet known)
 <= data "juju_offer" "ca_certificate" {
      + application_name = (known after apply)
      + endpoints        = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + url              = (known after apply)
    }

  # module.iam.data.juju_offer.database will be read during apply
  # (config refers to values not yet known)
 <= data "juju_offer" "database" {
      + application_name = (known after apply)
      + endpoints        = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + url              = (known after apply)
    }

  # module.iam.data.juju_offer.traefik_route will be read during apply
  # (config refers to values not yet known)
 <= data "juju_offer" "traefik_route" {
      + application_name = (known after apply)
      + endpoints        = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + url              = (known after apply)
    }

  # module.iam.juju_integration.hydra_database will be created
  + resource "juju_integration" "hydra_database" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "pg-database"
          + name     = "hydra"
        }
      + application {
          + endpoint  = (known after apply)
          + name      = (known after apply)
          + offer_url = (known after apply)
        }
    }

  # module.iam.juju_integration.hydra_login_ui_ui_info will be created
  + resource "juju_integration" "hydra_login_ui_ui_info" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "login-ui"
        }
    }

  # module.iam.juju_integration.hydra_public_route will be created
  + resource "juju_integration" "hydra_public_route" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "public-route"
          + name     = "hydra"
        }
      + application {
          + endpoint  = (known after apply)
          + name      = (known after apply)
          + offer_url = (known after apply)
        }
    }

  # module.iam.juju_integration.kratos_database will be created
  + resource "juju_integration" "kratos_database" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "pg-database"
          + name     = "kratos"
        }
      + application {
          + endpoint  = (known after apply)
          + name      = (known after apply)
          + offer_url = (known after apply)
        }
    }

  # module.iam.juju_integration.kratos_hydra_info will be created
  + resource "juju_integration" "kratos_hydra_info" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "kratos"
        }
    }

  # module.iam.juju_integration.kratos_login_ui_info will be created
  + resource "juju_integration" "kratos_login_ui_info" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "kratos-info"
          + name     = "kratos"
        }
      + application {
          + endpoint = "kratos-info"
          + name     = "login-ui"
        }
    }

  # module.iam.juju_integration.kratos_login_ui_ui_info will be created
  + resource "juju_integration" "kratos_login_ui_ui_info" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "kratos"
        }
      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "login-ui"
        }
    }

  # module.iam.juju_integration.kratos_public_route will be created
  + resource "juju_integration" "kratos_public_route" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "public-route"
          + name     = "kratos"
        }
      + application {
          + endpoint  = (known after apply)
          + name      = (known after apply)
          + offer_url = (known after apply)
        }
    }

  # module.iam.juju_integration.login_ui_hydra_info will be created
  + resource "juju_integration" "login_ui_hydra_info" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "login-ui"
        }
    }

  # module.iam.juju_integration.login_ui_public_route will be created
  + resource "juju_integration" "login_ui_public_route" {
      + id         = (known after apply)
      + model_uuid = (known after apply)

      + application {
          + endpoint = "public-route"
          + name     = "login-ui"
        }
      + application {
          + endpoint  = (known after apply)
          + name      = (known after apply)
          + offer_url = (known after apply)
        }
    }

  # module.iam.juju_offer.kratos_info_offer will be created
  + resource "juju_offer" "kratos_info_offer" {
      + application_name = "kratos"
      + endpoints        = [
          + "kratos-info",
        ]
      + id               = (known after apply)
      + model_uuid       = (known after apply)
      + name             = "kratos-info-offer"
      + url              = (known after apply)
    }

  # module.openfga.juju_application.openfga will be created
  + resource "juju_application" "openfga" {
      + config      = {}
      + constraints = ""
      + id          = (known after apply)
      + machines    = (known after apply)
      + model_type  = (known after apply)
      + model_uuid  = (known after apply)
      + name        = "openfga-k8s"
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "openfga-k8s"
          + revision = (known after apply)
        }
    }

  # module.postgresql.juju_application.k8s_postgresql will be created
  + resource "juju_application" "k8s_postgresql" {
      + config             = {}
      + constraints        = "arch=amd64"
      + id                 = (known after apply)
      + machines           = (known after apply)
      + model_type         = (known after apply)
      + model_uuid         = (known after apply)
      + name               = "postgresql-k8s"
      + resources          = {}
      + storage            = (known after apply)
      + storage_directives = {}
      + trust              = true
      + units              = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "14/edge"
          + name     = "postgresql-k8s"
          + revision = (known after apply)
        }
    }

  # module.traefik.juju_application.traefik will be created
  + resource "juju_application" "traefik" {
      + config             = {}
      + constraints        = "arch=amd64"
      + id                 = (known after apply)
      + machines           = (known after apply)
      + model_type         = (known after apply)
      + model_uuid         = (known after apply)
      + name               = "traefik-public"
      + storage            = (known after apply)
      + storage_directives = {}
      + trust              = true
      + units              = 1

      + charm {
          + base     = (known after apply)
          + channel  = "latest/edge"
          + name     = "traefik-k8s"
          + revision = (known after apply)
        }
    }

  # module.iam.module.hydra.juju_application.application will be created
  + resource "juju_application" "application" {
      + config      = {}
      + constraints = "arch=amd64"
      + id          = (known after apply)
      + machines    = (known after apply)
      + model_type  = (known after apply)
      + model_uuid  = (known after apply)
      + name        = "hydra"
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/stable"
          + name     = "hydra"
          + revision = (known after apply)
        }
    }

  # module.iam.module.hydra.juju_offer.oauth_offer will be created
  + resource "juju_offer" "oauth_offer" {
      + application_name = "hydra"
      + endpoints        = [
          + "oauth",
        ]
      + id               = (known after apply)
      + model_uuid       = (known after apply)
      + name             = "oauth-offer"
      + url              = (known after apply)
    }

  # module.iam.module.kratos.juju_application.application will be created
  + resource "juju_application" "application" {
      + config      = {}
      + constraints = "arch=amd64"
      + id          = (known after apply)
      + machines    = (known after apply)
      + model_type  = (known after apply)
      + model_uuid  = (known after apply)
      + name        = "kratos"
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/stable"
          + name     = "kratos"
          + revision = (known after apply)
        }
    }

  # module.iam.module.login_ui.juju_application.application will be created
  + resource "juju_application" "application" {
      + config      = {}
      + constraints = "arch=amd64"
      + id          = (known after apply)
      + machines    = (known after apply)
      + model_type  = (known after apply)
      + model_uuid  = (known after apply)
      + name        = "login-ui"
      + resources   = {
          + "oci-image" = "ghcr.io/canonical/identity-platform-login-ui:v0.24.2"
        }
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/stable"
          + name     = "identity-platform-login-ui-operator"
          + revision = (known after apply)
        }
    }

Plan: 37 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*